Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOption Property
 An insert in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingHostByElementsInAnotherDesignOption { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingHostByElementsInAnotherDesignOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingHostByElementsInAnotherDesignOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace